{"8e2f7f893ae10591addc7d5de5ec0926": "Baggage allowance varies greatly depending on your airline and ticket class.  Check your airline's website or your ticket confirmation for specific details on checked baggage and carry-on limits (weight and size restrictions).  Overweight or oversized baggage will incur extra fees. Consider pre-paying for extra baggage online to save money.  If unsure, contact your airline directly before arriving at the airport to avoid delays.  I cannot provide real-time baggage allowance information as it's airline specific.\n", "7337097cae97660cfd7afd8ef4fd9191": "For Delhi (DEL) to Chennai (MAA) flights, you'll likely depart from Indira Gandhi International Airport (DEL).  Terminal navigation depends on your airline; check your boarding pass.  Allow 15-20 minutes walking time between terminals.  Security checkpoints can have variable wait times; arrive at least 2 hours before your flight.\n\nLounge access depends on your airline or credit card; check eligibility beforehand.  Transportation from DEL includes the Metro, taxis, and pre-booked airport transfers. At MAA, taxis and local buses are readily available.  Amenities at both airports include restaurants, shops, and ATMs.  Specific real-time wait times are unavailable but check your airline app and airport websites for updates.\n", "8266cbec2295ae2c548563d169e3ee28": "I cannot provide assistance or information related to illegal activities such as drug possession or trafficking.  My purpose is to help with safe and legal travel.  Possession or use of illegal drugs at an airport can lead to serious legal consequences, including arrest and imprisonment.  If you require assistance with a medical emergency or have questions about medications you are traveling with, please contact airport security or medical personnel immediately.  For legal advice, consult a lawyer.\n", "27a3a69580eb3e46c3057b6bc0a44c6e": "Many airports offer accessibility services.  Look for designated accessible entrances, elevators, and ramps.  Wheelchair assistance is usually available; pre-booking is recommended.  Check your airline's website or contact airport information for details on wheelchair services and estimated wait times.  Service animals are generally permitted.  Accessible restrooms and seating are located throughout terminals.  Specific locations vary by airport; consult your airport's website for detailed accessibility maps.  Expect longer security processing times with assistive devices.  Be prepared to inform TSA agents about your needs.\n", "c8845cd38a6c61f24f76c48d7eb67086": "TSA PreCheck significantly speeds up security.  Enroll online beforehand.  Arrive at least 1 hour before your flight. Ensure your ID and boarding pass are readily accessible.  Remove electronics larger than a cell phone from your carry-on.  Liquids must be in 3.4-ounce bottles within a quart-sized bag.  Shoes typically stay on, but be prepared to remove them if requested. Expect a shorter wait than standard security lines; however, wait times can vary.  Check the TSA website for real-time wait times at your specific airport.\n", "b3fde093c5c1f63e94c0cea5683e8018": "Indigo domestic flights in Delhi operate from Terminal 1, Delhi Airport (DEL).  Navigation within T1 is generally straightforward, with clear signage.  Allow 30-45 minutes walking time from check-in to your gate, depending on distance.\n\nSecurity checkpoints can be busy; arrive at least 2 hours prior to departure.  Pre-book your security check if available to save time.\n\nLounge access depends on your Indigo fare type or airline membership.  Check your ticket or membership for eligibility.\n\nTransportation options include taxis, metro (Airport Express Line), and pre-booked airport transfers.\n\nAmenities include ATMs, restaurants, duty-free shops, and Wi-Fi.  Specific shops and restaurant locations are available on the Delhi Airport website.\n\nReal-time information on flight status, gate changes, and wait times are best obtained through the Delhi Airport app or your flight's airline app.\n", "90603df853c9b48f253722bc51414a7f": "Air India baggage allowance varies depending on your ticket class (Economy, Premium Economy, Business, First), route, and frequent flyer status.  Check your ticket or Air India's website (airindia.com) for precise details.  Generally, Economy allows one checked bag and one carry-on, while higher classes offer more.  Carry-on size restrictions are usually specified as well.  Always confirm directly with Air India or your booking agent for your specific flight's baggage allowance before you arrive at the airport.  Oversized or overweight bags may incur extra charges.\n", "8237cacf6076c01f2e797e9b7363490a": "Air India's baggage allowance for economy class varies depending on your route and booking class.  Check your ticket or Air India's website for precise details. Generally, expect one checked bag (weight and size restrictions apply), and a smaller carry-on bag.  Oversized or overweight bags incur extra charges.  Always confirm your allowance *before* arriving at the airport to avoid delays.  For specific weight and dimension limits for your flight, consult your ticket or the Air India website using your booking reference.\n", "fa53d0786568b22135682c6bc0a97d22": "Air India's domestic economy baggage allowance varies depending on the specific fare and route, but generally allows one checked bag up to 15kg (33lbs) and one carry-on bag (typically 7kg/15lbs with size restrictions).  Always check your booking confirmation for precise details.  Exceeding the allowance will likely incur extra fees.  Contact Air India directly or refer to their website for the most up-to-date and specific information related to your flight.\n", "6bb0c1a73a3cbe45ec1a10271fa98bf2": "Duty-free shopping locations vary by airport.  Most large international airports have duty-free shops located in the departure area, after security.  Expect to find them near gates or in designated shopping areas. Walking time to these shops depends on the airport layout and your gate location, but typically ranges from 5-20 minutes.  Check your airport's website or app for a detailed map showing duty-free locations.  Remember that regulations on liquids and quantities purchased vary by country; familiarize yourself with these before purchasing.  Enjoy your shopping!\n", "77c291a30ceae4eb019ce9c75815ae39": "To reach Jalandhar from Delhi Airport (DEL), several options exist:\n\n1. **Pre-booked taxi/cab:**  A comfortable but potentially expensive option. Expect a 10-12 hour journey. Cost varies depending on the service.\n\n2. **Train:**  A more affordable option.  Take the Airport Express Line to New Delhi Railway Station, then board a train to Jalandhar.  Journey time is approximately 7-8 hours. Check train schedules on IRCTC.\n\n3. **Bus:**  The most budget-friendly option, though the journey is long (12-14 hours). Several state-run and private buses operate this route.\n\nReal-time travel information is best obtained through apps like Google Maps or dedicated travel apps showing live traffic and train schedules.  Consider booking transportation in advance, especially during peak travel times.\n", "2740bb2c33de86d14a455ebf836b3aed": "There's no direct transport from Delhi Airport (DEL) to Jalandhar, Pehowa (assuming you mean Pehowa near Jalandhar).  You'll need a combination of transport.  Options include:\n\n1. **Taxi/Cab:**  A pre-booked cab from outside the airport will be the fastest, taking approximately 5-6 hours depending on traffic. Costs vary.\n\n2. **Train:** Take the Airport Express Line to New Delhi Railway Station, then a train to Jalandhar City station.  Journey time to Jalandhar will be 6-8 hours, depending on the train chosen. From there, hire local transport to Pehowa.\n\nCheck train schedules on IRCTC (Indian Railways) website for precise timings.  Consider travel time to and from the train stations when planning.  The overall journey time will be significantly longer than a taxi.\n", "5855b0965d8be60be557b98bc89d7624": "To reach Jalandhar from Delhi Airport (DEL), Punbus is a viable option.  Check their website or app for real-time bus timings and schedules; these vary.  The journey takes approximately 8-10 hours depending on traffic.\n\nFrom DEL, you'll need to reach the Punbus boarding point, likely near the airport or a designated pickup location.  Consider pre-booking your ticket to secure your seat.  Other options include taxis (expensive, ~ 5-6 hour drive), or hiring a private car.\n\nAirport navigation at DEL: Terminal navigation depends on your departing/arriving terminal (T1, T3).  Signage is generally clear, but allow extra time. Security lines can be long; arrive at least 2 hours before your flight.  Lounge access depends on your airline or credit card membership.\n", "e1aa18a808dda30aef335d46b3ab45d8": "To travel between Delhi T3 and T1, the most efficient option is the Airport Metro Express.  The journey takes approximately 20 minutes.  Alternatively, a pre-booked taxi or ride-sharing service will take approximately 30-45 minutes depending on traffic, costing more.  Walking is not feasible due to the distance.  Allow extra time for check-in and security at your destination terminal.  The Airport Metro Express has stations conveniently located near both terminals.  Real-time travel times can be found on the Delhi Metro Rail Corporation website or app.\n", "0372fb211f32395923b25b7ab0a71ba3": "Delhi Airport (DEL) offers assistance for older adults.  Look for \"Senior Citizen Assistance\" signage upon arrival.  Wheelchair assistance is available upon request; book in advance through your airline or at the airport information desk.  Designated seating areas with ample space are located throughout terminals.  Escort services may be available for a fee – inquire at information counters.  Walking times between terminals vary greatly (10-30 minutes); use the airport's moving walkways and elevators where possible.  For transportation to your final destination, pre-booked taxis or airport-provided car services are recommended.  Information on specific amenities, like restrooms and rest areas, is available on the DEL airport website and mobile app.  Real-time location-based assistance is limited; staff will be your best source for immediate guidance.\n", "991a14db8ba3ddd8bed93370b0157057": "I cannot directly search and book flights.  To find the cheapest flights from New York to London next month, use flight comparison websites like Google Flights, Skyscanner, or Kayak.  These will show you options and prices from various airlines.\n\nOnce you have your flight details, I can assist with airport navigation.  For example, at Heathrow (LHR), Terminal 5 is a long terminal; allow 30-45 minutes walking time between gates.  TSA PreCheck/Global Entry significantly speeds up security. Lounge access depends on your airline or credit card status.  Transportation options from LHR include the Heathrow Express train (15 minutes to Paddington Station) and various buses.  Specific amenities vary by airport; check your airport's website.\n", "6627870c944514c26b720f906e7a66d8": "Dubai International Airport's Terminal 3 is located on the south side of the airport.  Walking time from other terminals varies significantly and isn't practically feasible;  airport shuttle trains (approx. 5-10 min ride) connect terminals.  \n\nFor security, allow ample time (at least 1.5 hours pre-departure). TSA PreCheck/equivalent programs can expedite this.  Lounges vary by airline and membership; check your airline or credit card benefits.\n\nTransportation options include taxis, metro (red line), and airport buses.  DXB offers extensive amenities including ATMs, currency exchange, duty-free shops, and numerous dining options.  Specific gate information is available on your flight's boarding pass and flight information displays.  Real-time wait times are displayed at security checkpoints.\n", "d35098b039c10b6e6349fc6fa8ae53cd": "With a 6-hour layover in Hamad International Airport (DOH), Doha, you have options!  Navigation within DOH is easy; terminals are connected by efficient walkways (approx 15 min walk between terminals).  Security checkpoints vary in wait times—allow at least 30 minutes.  Numerous lounges offer access with Priority Pass or airline status.  Transportation to the city center involves taxis (30 min, ~$25) or the metro (45 min, ~$2).  DOH boasts impressive amenities:  a massive indoor garden, Oryx Airport Hotel, multiple restaurants, and duty-free shopping.  Real-time wait times are available on the DOH app.  For a quick city visit, consider a guided tour, otherwise explore the airport's offerings.\n", "eb4a6b328312b27f4cccaf176f831d54": "Yes, you can carry baby formula on a plane.  TSA allows reasonable quantities of formula through security checkpoints.  Declare it to TSA officers if necessary.  For larger quantities, consider checking it in your luggage.  Remember, liquid rules still apply to other items in your carry-on.\n\nI cannot provide real-time gate information or exact walking times without your flight details and airport.  To find your gate, refer to your boarding pass and airport monitors.  Estimated gate-to-security times vary greatly depending on the airport; expect 15-30 minutes minimum.  Lounge access depends on your airline and/or credit card benefits.  Transportation options include taxis, ride-sharing services, and airport shuttles.  Airport amenities vary widely – check your airport's website for specific details.\n", "2e63c451871a277aa3caa65754f2dd6c": "No, you cannot carry illegal drugs on a plane.  This is a serious crime with severe consequences, including arrest and imprisonment.  Declare any prescription medications to airport security with proper documentation.  Failure to do so can result in confiscation and potential legal repercussions.  If you have questions about specific medications, contact your airline or the Transportation Security Administration (TSA) well in advance of your flight.\n", "59863096d9585519fddd43b0413c5767": "No, you generally cannot carry liquor in your carry-on baggage on a plane.  Liquids, including alcohol, must be placed in containers of 3.4 ounces (100ml) or less and fit inside a quart-sized, clear, resealable plastic bag.  Larger quantities must be checked in your luggage.  Check your airline's specific baggage allowance and restrictions as regulations vary.  Note that some countries have additional restrictions on importing alcohol.  Always check the regulations for both your departing and arrival destinations before packing.\n", "e36d7ca940a3aa5bc99a2cf691949d95": "If your luggage is lost or delayed, immediately report it to your airline's baggage service office located near baggage claim.  Provide your baggage tag number and flight information. They will file a lost luggage report and give you a reference number.  You'll likely receive updates via email or phone.  For immediate needs, airlines may provide basic toiletries and clothing.  Check their lost luggage policy for compensation details.  Expect a wait time at the baggage service office that varies, potentially 30-60 minutes depending on the queue length.  Consider using the airline's app for real-time status updates.\n", "de2f1dd421507fcea0d7dfbd6e18973f": "IGA (Sydney Airport) offers comprehensive accessibility services.  Wheelchair assistance is available upon request (book in advance for smoother service); allow extra time.  Designated accessible restrooms are located throughout each terminal.  Accessible parking is available near terminal entrances.  Assistance dogs are permitted.  Visual and auditory aids, including tactile paving, are present in key areas.  For specific gate locations or further assistance, inquire at information desks or use the airport app's accessibility features.  Walking times vary significantly depending on your origin and destination, but allow extra time to navigate.\n", "9f939aff58acb7153dd83aff8e2dd290": "Indira Gandhi International Airport (DEL) offers a range of amenities.  These include numerous duty-free shops, restaurants and cafes (ranging from quick bites to fine dining), currency exchange bureaus, ATMs, prayer rooms, and baby care rooms.  Specific terminal locations vary; check airport maps for details.  Wi-Fi is available throughout the airport.  For specific shop/restaurant details or real-time wait times, consult the official DEL website or app. Walking times between terminals are typically 15-20 minutes, but consider using the airport's free shuttle service.\n", "6dae21df617947832c9ae61d57f68431": "I cannot provide specific visa requirements.  Visa rules are complex and vary based on individual circumstances.  For accurate information on US tourist visa requirements for Indian citizens, please visit the official website of the U.S. Embassy or Consulate in India. They will have the most up-to-date and detailed information including necessary forms, supporting documents (like financial proof and itinerary), and application procedures.  Contacting them directly is also recommended.\n", "ba6e761dcdcb89204d2997ad8f12f36a": "I cannot provide real-time weather information.  Please check a reliable weather app or website for London's forecast this week.  Regarding your travel from Delhi,  I need your specific arrival airport (e.g., Heathrow, Gatwick) and flight details to offer precise terminal/gate navigation.\n\nGenerally, at Heathrow and Gatwick, allow 30-45 minutes walking time between terminals. Security checkpoints vary in wait times; check the airport's website for live updates.  Lounge access depends on your airline and class of travel or credit card membership.  Transportation options include the Heathrow Express, Gatwick Express trains, Underground, taxis, and buses. Airport amenities vary but often include restaurants, duty-free shops, and currency exchange.\n", "015737d25641d11278ed97d6b2a066a3": "I cannot provide real-time travel restriction information.  Government regulations change frequently.  For the most up-to-date details on travel restrictions for Indian citizens going to Canada, please check the official websites of the Canadian government (Immigration, Refugees and Citizenship Canada) and the Indian government's Ministry of External Affairs.  These sites will detail visa requirements, COVID-19 related protocols (if any), and other necessary documentation.  Failure to meet these requirements may result in denied boarding or entry.\n", "60c80b0add64c5e8dc8a75b98ccd2a85": "Indian flight regulations prohibit sharp objects (knives, scissors exceeding 4 inches), flammable items (lighters, matches – limited exceptions apply), explosives, and hazardous materials in cabin baggage.  Liquids, gels, and aerosols must be in containers of 100ml or less, within a single, resealable transparent bag.  Power banks are permitted, but check airline-specific limitations on wattage and quantity.  Always check your specific airline's website for the most up-to-date prohibited items list before your flight.  Failure to comply can result in confiscation or denied boarding.\n", "39d7f93eb43e702603b2302ba3b15b31": "Air India's domestic economy baggage allowance varies depending on the specific fare class booked.  Check your ticket or Air India's website for precise details. Generally, it includes one checked bag (15kg) and one cabin bag (7kg).  Overweight baggage incurs extra charges.  Confirm your allowance *before* arriving at the airport to avoid delays.  For real-time information on specific flights, refer to the Air India app or website.\n", "68c1a74b80f58c3bb163cedb2a63c3ab": "Indigo's domestic economy baggage allowance typically includes one checked bag up to 15kg and a free carry-on bag.  Dimensions vary, check Indigo's website for specifics.  Overweight/oversized bags incur extra charges.  Note:  These allowances can vary based on specific routes or promotions. Always confirm your allowance directly with Indigo before your flight using your booking reference.  I cannot provide real-time guidance on baggage allowance changes.\n", "fcbf3db689156220c0e969c9807ee027": "Delhi Airport (DEL) has three terminals.  Terminal 3 is the largest, with extensive walking distances; allow at least 30 minutes between gates.  Security checkpoints can have varying wait times; arrive 2 hours before international flights, 1.5 hours for domestic.  Lounge access depends on your airline or credit card; check your eligibility beforehand.  Transportation options include the Airport Express Line metro (fastest to city center), taxis, and pre-booked private cars.  Amenities include numerous restaurants, shops, spas, and prayer rooms.  Specific gate and wait times are unavailable in real-time.  For detailed information, consult the Delhi Airport website or app.\n"}